//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

//* ЗАДАЧА. МАСИВ ЗБІГІВ
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Функція findMatches() приймає довільну кількість аргументів. Першим аргументом завжди буде масив чисел, а решта аргументів будуть просто числами.

// Доповни код функції таким чином, щоб вона повертала новий масив matches, в якому будуть тільки ті аргументи, починаючи з другого, які є в масиві першого аргументу.
// Наприклад, findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7) повинна повернути масив [1, 2], тому що тільки вони є в масиві першого аргументу.

//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена функція findMatches()
// Виклик findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7) повертає [1, 2]
// Виклик findMatches([4, 89, 17, 36, 2], 8, 17, 89, 27, 2) повертає [17, 89, 2]
// Виклик findMatches([10, 24, 41, 6, 9, 19], 24, 11, 9, 23, 41) повертає [24, 9, 41]
// Виклик findMatches([63, 11, 8, 29], 4, 7, 16) повертає []
//! ----------------------------------------------Рішення---------------------------------------------------------------------

// Change code below this line
function findMatches(firstArg, ...otherArgs) {
  const matches = [];
  for (let i = 0; i < firstArg.length; i++) {
    for (const arg of otherArgs) {
      if (arg === firstArg[i]) {
        matches.push(arg);
      }
    }
  }
  console.log(matches);

  return matches;
}

findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7);
findMatches([4, 89, 17, 36, 2], 8, 17, 89, 27, 2);
findMatches([10, 24, 41, 6, 9, 19], 24, 11, 9, 23, 41);
findMatches([63, 11, 8, 29], 4, 7, 16);

// console.log(finalSettings);
