//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

//* ЗАДАЧА. КРАМНИЦЯ ЗІЛЛЯ «У СТАРОЇ ЖАБИ»
//! ----------------------------------------------завдання---------------------------------------------------

//todo: До нас звернулася власниця крамниці зілля «У старої жаби» і замовила програму для ведення інвентарю - додавання, видалення, пошуку та оновлення зілля.
//todo: Додай об'єкту atTheOldToad властивість potions, значенням якої зроби порожній масив.
//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна atTheOldToad
// Значення змінної atTheOldToad - це об'єкт
// Значення властивості atTheOldToad.potions - це масив []
//! ----------------------------------------------Рішення---------------------------------------------------------------------

const atTheOldToad = {
  potions: [],
};

console.log(atTheOldToad.potions);
