//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

//* ЗАДАЧА: ПІДРАХУНОК ВЛАСТИВОСТЕЙ

//! ----------------------------------------------завдання---------------------------------------------------

//todo: Напиши функцію countProps(object), яка рахує і повертає кількість власних властивостей об'єкта в параметрі object.
//todo: Використовуй змінну propCount для зберігання кількості властивостей об'єкта.

//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена функція countProps(object)
// Виклик countProps({}) повертає 0
// Виклик countProps({ name: "Mango", age: 2 }) повертає 2
// Виклик countProps({ mail: "poly@mail.com", isOnline: true, score: 500 }) повертає 3
// Функція підраховує тільки власні властивості об'єкта

//! ----------------------------------------------Рішення---------------------------------------------------------------------

function countProps(object) {
  let propCount = 0;
  for (const key in object) {
    if (object.hasOwnProperty(key)) {
      propCount += 1;
    }
  }
  console.log(propCount);

  return propCount;
}

countProps({});
countProps({ name: 'Mango', age: 2 });
countProps({ mail: 'poly@mail.com', isOnline: true, score: 500 });

// console.log(values);
