//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// На відміну від рядків, елементи масиву можна змінювати, звернувшись до них за індексом і присвоївши інше значення.

// const numbers = [1, 2, 3, 4, 5];
// numbers[0] = 7;
// numbers[2] = 14;
// console.log(numbers); // [7, 2, 14, 4, 5];
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Виконай перевизначення значення елементів з індексами 1 і 3. Заміни "plum" на "peach", а "orange" на "banana".
//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна fruits
// Значення змінної fruits - це масив ["apple", "peach", "pear", "banana"]

//! ----------------------------------------------Рішення:-----------------------------------------------------
const fruits = ['apple', 'plum', 'pear', 'orange'];
fruits[1] = 'peach';
fruits[fruits.length - 1] = 'banana';

console.log(fruits);
