//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------
// Замість того, щоб повертати результат ділення, операція за модулем (%) повертає цілочисельну остачу від ділення двох чисел - діленого і дільника.

// 5 % 1 = 0;
// 5, поділене на 1, дорівнює 5, а остача - 0

// 5 % 2 = 1;
//  5, поділене на 2, дорівнює 2, а остача - 1

// 5 % 3 = 2;
//  5, поділене на 3, дорівнює 1, а остача - 2

// 5 % 4 = 1;
//  5, поділене на 4, дорівнює 1, а остача - 1

// 5 % 5 = 0;
//  5, поділене на 5, дорівнює 1, а остача - 0
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Доповни вираз остачі від ділення таким чином, щоб код проходив тести.

//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна a
// Значення змінної a - це число 0
// Оголошена змінна b
// Значення змінної b - це число 1
// Оголошена змінна c
// Значення змінної c - це число 3
// Оголошена змінна d
// Значення змінної d - це число 5
// Оголошена змінна e
// Значення змінної e - це число 2

//! ----------------------------------------------Рішення:-----------------------------------------------------
// Change code below this line
const a = 3 % 1;
const b = 4 % 3;
const c = 11 % 8;
const d = 12 % 7;
const e = 8 % 6;

console.log(a);
console.log(b);
console.log(c);
console.log(d);
console.log(e);

// console.log(total);
