//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// Довжина масиву, тобто кількість його елементів, зберігається у властивості length. Це динамічна величина, яка змінюється автоматично під час додавання або видалення елементів.

// const planets = ["Earth", "Mars", "Venus"];
// console.log(planets.length); // 3
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Оголоси змінну fruitsArrayLength і присвой їй довжину масиву fruits, використовуючи властивість length.
//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна fruitsArrayLength
// Значення змінної fruitsArrayLength - це число 4

//! ----------------------------------------------Рішення:-----------------------------------------------------
const fruits = ['apple', 'peach', 'pear', 'banana'];
const fruitsArrayLength = fruits.length;
console.log(fruits);
console.log(fruitsArrayLength);
