//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// Масив використовується для зберігання впорядкованої колекції елементів. Він оголошується відкритою і закритою квадратною дужкою [] - літералом масиву. Всередині дужок кожен елемент масиву розділяється комою.

// const planets = ["Earth", "Mars", "Venus"];
//* Корисно

// Оголошуючи змінну для об'єкта або масиву, програмісти, як правило, використовують const. Вони роблять це для того, щоб випадково не перезаписати значення, оскільки спроба перезапису викличе помилку до того, як код потрапить до користувача.
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Оголоси змінну fruits і присвой їй масив фруктів - рядків "apple", "plum", "pear" і "orange".

//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна fruits
// Значення змінної fruits - це масив ["apple", "plum", "pear", "orange"]

//! ----------------------------------------------Рішення:-----------------------------------------------------
const fruits = ['apple', 'plum', 'pear', 'orange'];

console.log(fruits);
