//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------
// Комбіновані оператори - це коротший спосіб присвоїти змінній нове значення, ґрунтуючись на її попередньому значенні.

// Будемо збільшувати значення змінної age на одиницю від попереднього, імітуючи оновлення віку після дня народження користувача.

// let age = 25;
// // Класичний запис
// age = age + 1;
// console.log(age); // 26
// Спочатку виконується права частина виразу. Замість age підставляється 25, виконується операція додавання, і у змінну age записується 26.

// Виконаємо рефакторинг операції оновлення віку, використовуючи комбінований оператор присвоєння з додаванням.

// let age = 25;
// // Просто коротший запис, працює так само
// age += 1;
// console.log(age); // 26
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Заміни вирази зі стандартними математичними операторами на комбінований оператор присвоєння з додаванням, відніманням, множенням і діленням.

//! ----------------------------------------------Тести:-----------------------------------------------------

// Значення змінної a дорівнює 7
// Використаний оператор +=
// Значення змінної b дорівнює 6
// Використаний оператор -=
// Значення змінної c дорівнює 45
// Використаний оператор *=
// Значення змінної d дорівнює 2
// Використаний оператор /=

//! ----------------------------------------------Рішення---------------------------------------------------------------------

let a = 5;
let b = 10;
let c = 15;
let d = 20;

// Change code below this line
a += 2;
b -= 4;
c *= 3;
d /= 10;

console.log(a);
console.log(b);
console.log(c);
console.log(d);
