//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// Для зазначення свого порядку сортування методу sort(compareFunction) потрібно передати колбек-функцію з двома параметрами. Це функція порівняння (compare function), порядок сортування залежить від її результату. Метод sort() буде викликати її для двох довільних елементів.

// масив.sort((a, b) => {
//   // Callback function body
// });
// a - перший елемент для порівняння.
// b - другий елемент для порівняння.
// Якщо виклик compareFunction(a, b) повертає будь - яке від'ємне значення, тобто a менше b, сортування поставить a перед b.
// Це сортування за зростанням.

// const scores = [61, 19, 74, 35, 92, 56];
// const ascendingScores = [...scores].sort((a, b) => a - b);
// console.log(ascendingScores); // [19, 35, 56, 61, 74, 92]
// Якщо виклик compareFunction(a, b) повертає будь - яке додатне значення більше нуля, тобто b більше a, сортування поставить b перед a.
// Це сортування за спаданням.

// const scores = [61, 19, 74, 35, 92, 56];
// const descendingScores = [...scores].sort((a, b) => b - a);
// console.log(descendingScores); // [92, 74, 61, 56, 35, 19]
// Якщо виклик compareFunction(a, b) поверне 0, сортування залишить a і b незмінними по відношенню один до одного, але відсортує їх по
// відношенню до всіх інших елементів.
// Але взагалі неважливо, що повертати, якщо їх взаємний порядок не має значення.
//! ----------------------------------------------завдання---------------------------------------------------

//todo: Онлайн бібіліотеці необхідно відображати книги, відсортовані за датою видання, за її зростанням або спаданням.
// Доповни код таким чином, щоб у змінній ascendingReleaseDates вийшла копія масиву releaseDates, відсортована за зростанням, а у змінній descendingReleaseDates - копія, відсортована за спаданням.
//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошена змінна releaseDates
// Значення змінної releaseDates - це масив [2016, 1967, 2008, 1984, 1973, 2012, 1997]
// Оголошена змінна ascendingReleaseDates
// Значення змінної ascendingReleaseDates - це масив [1967, 1973, 1984, 1997, 2008, 2012, 2016]
// Оголошена змінна descendingReleaseDates
// Значення змінної descendingReleaseDates - це масив [2016, 2012, 2008, 1997, 1984, 1973, 1967]
// Використаний метод sort()
//! ----------------------------------------------Рішення---------------------------------------------------------------------

const releaseDates = [2016, 1967, 2008, 1984, 1973, 2012, 1997];
// Change code below this line

const ascendingReleaseDates = [...releaseDates].sort((a, b) => a - b);
console.log('ascendingReleaseDates: ', ascendingReleaseDates);

const descendingReleaseDates = [...releaseDates].sort((a, b) => b - a);
console.log('descendingReleaseDates: ', descendingReleaseDates);
