//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// Ключове слово extends дозволяє реалізувати наслідування класів, коли один клас(дочірній, похідний) наслідує
// властивості та методи іншого класу(батьківського).

// class Child extends Parent {
//   // ...
// }
// У виразі class Child extends Parent дочірній клас Child наслідує(розширює) від батьківського класу Parent.
// Це означає, що ми можемо оголосити базовий клас, який зберігає загальні характеристики і методи для групи похідних класів,
//   які наслідують властивості і методи батьківського, але також додають свої унікальні.

//     Наприклад, у застосунку є користувачі з різними ролями — адміністратор, копірайтер, контент менеджер тощо.У кожного типу
// користувача є набір загальних характеристик, наприклад, пошта і пароль, але також є й унікальні.

// Створивши незалежні класи для кожного типу користувача, ми отримаємо дублювання загальних властивостей і методів, і, якщо
// необхідно змінити, наприклад, назву властивості, доведеться проходити по усіх класах, а це незручно і вимагає багато часу.

// Замість цього, можна створити загальний клас User, який буде зберігати набір загальних властивостей і методів, після чого,
//   створити класи для кожного типу користувача, які наслідують цей набір від класу User.За потреби змінити щось спільне, достатньо
//    буде змінити тільки код класу User.

// class User {
//   constructor(email) {
//     this.email = email;
//   }

//   get email() {
//     return this.email;
//   }

//   set email(newEmail) {
//     this.email = newEmail;
//   }
// }

// class ContentEditor extends User {
//   // Тіло класу ContentEditor
// }

// const editor = new ContentEditor("mango@mail.com");
// console.log(editor); // { email: "mango@mail.com" }
// console.log(editor.email); // "mango@mail.com"
// Клас ContentEditor наслідує від класу User його конструктор, гетер і сетер email, а також однойменну публічну властивість.
// Важливо пам'ятати, що приватні властивості і методи батьківського класу не наслідуються дочірнім класом.
//! ----------------------------------------------завдання---------------------------------------------------

//todo: У застосунку потрібен адміністратор з можливістю додавати пошти користувачів у чорний список.

// Оголоси клас Admin, який наслідує від класу User
// Додай класу Admin публічну статичну властивість AccessLevel (рівень доступу), значення якої — це об'єкт {BASIC: "basic", SUPERUSER: "superuser"}
//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошений клас Admin
// Клас Admin наслідує від класу User
// Клас Admin містить публічну статичну властивість AccessLevel
// Звернення до Admin.AccessLevel.BASIC повертає рядок "basic"
// Звернення до Admin.AccessLevel.SUPERUSER повертає рядок "superuser"
//! ----------------------------------------------Рішення---------------------------------------------------------------------

class User {
  constructor(email) {
    this.email = email;
  }

  get email() {
    return this.email;
  }

  set email(newEmail) {
    this.email = newEmail;
  }
}
class Admin extends User {
  static AccessLevel = { BASIC: 'basic', SUPERUSER: 'superuser' };
}
console.log('AccessLevel: ', Admin.AccessLevel);

console.log(Admin.AccessLevel.BASIC);
console.log(Admin.AccessLevel.SUPERUSER);
