//! -----------------------------------------------ТЕОРІЯ-----------------------------------------------------------

// Синтаксис літерала об'єкта дозволяє створити один об'єкт. Проте, часто потрібно створити багато однотипних об'єктів з однаковим набором властивостей, але різними значеннями і методами для взаємодії з ними. Все це потрібно робити динамічно, під час виконання програми. З цією метою використовують класи - спеціальний синтаксис оголошення функції для створення об'єктів.

// Оголошення класу починається з ключового слова class, після якого стоїть ім'я класу і фігурні дужки - його тіло. Класи прийнято називати з великої літери, а у назві відображати тип об'єкта (іменник), що створюється.

// class User {
//   // Тіло класу
// }

// const mango = new User();
// console.log(mango); // {}

// const poly = new User();
// console.log(poly); // {}
// Результат виклику new User() - це об'єкт, який називається екземпляром класу, тому що містить дані і поведінку, що описуються класом.

//! ----------------------------------------------завдання---------------------------------------------------

//todo: Використовуючи ключове слово class, оголоси клас Car з порожнім тілом.

//! ----------------------------------------------Тести:-----------------------------------------------------

// Оголошений клас Car
// Результат виклику new Car() - це порожній об'єкт

//! ----------------------------------------------Рішення---------------------------------------------------------------------

class Car {}
console.log('Car: ', Car);
